In [1]:
import pandas as pd

In [2]:
emp = pd.read_excel(r"/Users/munna/Downloads/Rawdata.xlsx")
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [3]:
pd.__version__

'2.2.3'

In [4]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [6]:
emp.isna().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [8]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [9]:
emp.info

<bound method DataFrame.info of      Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+>

# Data Cleaning or Data Cleansing

In [11]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [12]:

emp['Name'] # Values have regression characters Lets remove

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [13]:
emp["Name"] = emp["Name"].str.replace(r'\W','',regex=True) # Replace extra characters

In [14]:
emp["Name"]

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [17]:
emp["Name"] = emp["Salary"].str.replace(r'\W','',regex=True)

In [18]:
emp["Name"] = emp["Location"].str.replace(r'\W','',regex=True)

In [19]:
emp

        Name          Domain       Age   Location   Salary      Exp
0     Mumbai   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Bangalore         Testing    45' yr  Bangalore  10%%000       <3
2        NaN  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3   Hyderbad     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4        NaN      Statistics     67-yr        NaN   30000-  5+ year
5      Delhi             NLP      55yr      Delhi  6000^$0      10+

In [22]:
emp["Domain"] = emp["Domain"].str.replace(r'\W','',regex=True)

emp

In [24]:
emp

          Name       Domain       Age   Location   Salary      Exp
0  Datascience  Datascience  34 years     Mumbai   5^00#0       2+
1      Testing      Testing    45' yr  Bangalore  10%%000       <3
2  Dataanalyst  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3    Analytics    Analytics       NaN   Hyderbad   2000^0      NaN
4   Statistics   Statistics     67-yr        NaN   30000-  5+ year
5          NLP          NLP      55yr      Delhi  6000^$0      10+

In [25]:
emp["Salary"] = emp["Salary"].str.replace(r'\W','',regex=True)

In [26]:
emp["Location"] = emp["Location"].str.replace(r'\W','',regex=True)

In [27]:
emp

          Name       Domain       Age   Location Salary      Exp
0  Datascience  Datascience  34 years     Mumbai   5000       2+
1      Testing      Testing    45' yr  Bangalore  10000       <3
2  Dataanalyst  Dataanalyst       NaN        NaN  15000   4> yrs
3    Analytics    Analytics       NaN   Hyderbad  20000      NaN
4   Statistics   Statistics     67-yr        NaN  30000  5+ year
5          NLP          NLP      55yr      Delhi  60000      10+

In [29]:
emp["Age"] = emp["Age"].str.extract('(\\d+)')
emp

          Name       Domain  Age   Location Salary      Exp
0  Datascience  Datascience   34     Mumbai   5000       2+
1      Testing      Testing   45  Bangalore  10000       <3
2  Dataanalyst  Dataanalyst  NaN        NaN  15000   4> yrs
3    Analytics    Analytics  NaN   Hyderbad  20000      NaN
4   Statistics   Statistics   67        NaN  30000  5+ year
5          NLP          NLP   55      Delhi  60000      10+

emp

In [30]:
emp["Exp"] = emp["Exp"].str.extract('(\\d+)')

In [31]:
emp

          Name       Domain  Age   Location Salary  Exp
0  Datascience  Datascience   34     Mumbai   5000    2
1      Testing      Testing   45  Bangalore  10000    3
2  Dataanalyst  Dataanalyst  NaN        NaN  15000    4
3    Analytics    Analytics  NaN   Hyderbad  20000  NaN
4   Statistics   Statistics   67        NaN  30000    5
5          NLP          NLP   55      Delhi  60000   10

In [32]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

# EDA Technique

In [33]:
emp

          Name       Domain  Age   Location Salary  Exp
0  Datascience  Datascience   34     Mumbai   5000    2
1      Testing      Testing   45  Bangalore  10000    3
2  Dataanalyst  Dataanalyst  NaN        NaN  15000    4
3    Analytics    Analytics  NaN   Hyderbad  20000  NaN
4   Statistics   Statistics   67        NaN  30000    5
5          NLP          NLP   55      Delhi  60000   10

In [34]:
clean_data = emp.copy() # Lets create another copy of emp

In [35]:
clean_data

          Name       Domain  Age   Location Salary  Exp
0  Datascience  Datascience   34     Mumbai   5000    2
1      Testing      Testing   45  Bangalore  10000    3
2  Dataanalyst  Dataanalyst  NaN        NaN  15000    4
3    Analytics    Analytics  NaN   Hyderbad  20000  NaN
4   Statistics   Statistics   67        NaN  30000    5
5          NLP          NLP   55      Delhi  60000   10

# 1) EDA Technique:  Missing Value Treatment

In [36]:
clean_data['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [37]:
import numpy as np

In [38]:
clean_data['Age'] = clean_data['Age'].fillna(np.mean(pd.to_numeric(clean_data['Age']))) # Apply Mean to the Missing Data using Numpy for Numerical Value

In [42]:
clean_data

          Name       Domain    Age   Location Salary  Exp
0  Datascience  Datascience     34     Mumbai   5000    2
1      Testing      Testing     45  Bangalore  10000    3
2  Dataanalyst  Dataanalyst  50.25        NaN  15000    4
3    Analytics    Analytics  50.25   Hyderbad  20000  4.8
4   Statistics   Statistics     67        NaN  30000    5
5          NLP          NLP     55      Delhi  60000   10

In [43]:
clean_data['Exp'] = clean_data['Exp'].fillna(np.mean(pd.to_numeric(clean_data['Exp'])))

In [44]:
clean_data

          Name       Domain    Age   Location Salary  Exp
0  Datascience  Datascience     34     Mumbai   5000    2
1      Testing      Testing     45  Bangalore  10000    3
2  Dataanalyst  Dataanalyst  50.25        NaN  15000    4
3    Analytics    Analytics  50.25   Hyderbad  20000  4.8
4   Statistics   Statistics     67        NaN  30000    5
5          NLP          NLP     55      Delhi  60000   10

In [45]:
clean_data['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [46]:
clean_data['Location'] = clean_data['Location'].fillna(clean_data['Location'].mode()[0]) # This is applied Mode for Categorical value

In [48]:
clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [50]:
clean_data

          Name       Domain    Age   Location Salary  Exp
0  Datascience  Datascience     34     Mumbai   5000    2
1      Testing      Testing     45  Bangalore  10000    3
2  Dataanalyst  Dataanalyst  50.25  Bangalore  15000    4
3    Analytics    Analytics  50.25   Hyderbad  20000  4.8
4   Statistics   Statistics     67  Bangalore  30000    5
5          NLP          NLP     55      Delhi  60000   10